In [1]:
import pandas as pd
import numpy as np

import matplotlib.pylab as plt
import seaborn as sns

In [2]:
att = pd.read_csv('https://gist.githubusercontent.com/o0amandagomez0o/20c8edc2cb83d33da03c8fd2f9db4c4c/raw/attendance.csv')

In [3]:
att.head()

,Unnamed: 0,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,P,T,H,P,P,T,P,P

In [4]:
#fix the ugly column name
att.rename(columns={'Unnamed: 0': 'name'}, inplace=True)

### pd.metl arguments
* id_vars = columns you want to keep (not melt)
* var_name = name of new column you created by melting columns
* value_name = column name for values

In [5]:
#make a wide table long
att = att.melt(id_vars='name', #keep this column fixed
                  var_name='date', #name of the new column
                  value_name='attend') #name of the new column based on the values of the "date" column

In [6]:
att.head()

    name        date attend
0  Sally  2018-01-01      P
1   Jane  2018-01-01      A
2  Billy  2018-01-01      A
3   John  2018-01-01      P
4  Sally  2018-01-02      T

In [7]:
#convert objects to values
att.attend = att.attend.map({'P':1, 'A':0, 'H':.5, 'T':.9})

In [8]:
att.head()

    name        date  attend
0  Sally  2018-01-01     1.0
1   Jane  2018-01-01     0.0
2  Billy  2018-01-01     0.0
3   John  2018-01-01     1.0
4  Sally  2018-01-02     0.9

In [9]:
cl = pd.read_csv('https://gist.githubusercontent.com/o0amandagomez0o/f6ea956fedae90420fd2ce4bd382ea8a/raw/coffee_levels.csv')
cl.head()

   hour coffee_carafe  coffee_amount
0     8             x       0.816164
1     9             x       0.451018
2    10             x       0.843279
3    11             x       0.335533
4    12             x       0.898291

In [10]:
#pivot the table 
clp=cl.pivot_table(index='hour', columns='coffee_carafe', values='coffee_amount')

In [11]:
clp.head()

coffee_carafe         x         y         z
hour
8              0.816164  0.189297  0.999264
9              0.451018  0.521502  0.915990
10             0.843279  0.023163  0.144928
11             0.335533  0.235529  0.311495
12             0.898291  0.017009  0.771947

In [12]:
#this is good for plotting and for seeing the pefromance of each carafe per hour

In [14]:
cr = pd.read_csv("https://gist.githubusercontent.com/o0amandagomez0o/6bb870ddd6cae613999b9cf33ac41c33/raw/cake_recipes.csv")

In [15]:
cr.head()

  recipe:position        225        250        275        300
0        a:bottom  61.738655  53.912627  74.414730  98.786784
1           a:top  51.709751  52.009735  68.576858  50.228470
2        b:bottom  57.095320  61.904369  61.196980  99.248541
3           b:top  82.455004  95.224151  98.594881  58.169349
4        c:bottom  96.470207  52.001358  92.893227  65.473084

In [16]:
#make a wide table long
cr = cr.melt(id_vars='recipe:position', #keep this column \
              var_name='temp', # name of the new column
                  value_name='score') #values for new column based on the "temp" column

In [17]:
cr.head()

  recipe:position temp      score
0        a:bottom  225  61.738655
1           a:top  225  51.709751
2        b:bottom  225  57.095320
3           b:top  225  82.455004
4        c:bottom  225  96.470207

In [18]:
#split the recipe:position column into two columns
cr[['recipe','position']] = cr['recipe:position'].str.split(':', expand=True)

In [ ]:
#drop old column
cr = cr.drop(columns='recipe:position')

In [19]:
#which recipe is better on average
cr.groupby('recipe').mean()

            score
recipe
a       63.922201
b       76.736074
c       75.874748
d       62.864844

In [22]:
#bring back the top score by recipe (by index)
cr.groupby('recipe').mean().idxmax()

score    b
dtype: object

In [23]:
#bring back just the top score
cr.groupby('recipe').mean().max()

score    76.736074
dtype: float64

In [24]:
#best by temp
cr.groupby('temp').mean()

          score
temp
225   71.306022
250   66.577437
275   74.886754
300   66.627655

In [26]:
#combination of recipe, rack position, and temp gives the best results
cr.groupby(['recipe', 'position', 'temp']).mean()

                          score
recipe position temp
a      bottom   225   61.738655
                250   53.912627
                275   74.414730
                300   98.786784
       top      225   51.709751
                250   52.009735
                275   68.576858
                300   50.228470
b      bottom   225   57.095320
                250   61.904369
                275   61.196980
                300   99.248541
       top      225   82.455004
                250   95.224151
                275   98.594881
                300   58.169349
c      bottom   225   96.470207
                250   52.001358
                275   92.893227
                300   65.473084
       top      225   71.306308
                250   82.795477
                275   92.098049
                300   53.960273
d      bottom   225   52.799753
                250   58.670419
                275   51.747686
                300   56.183110
       top      225   96.873178
                250   76.101363
                275   59.571620
                300   50.971626